{
  "Home": {
    "title": "Thiago Alves",
    "description": "I develop on the frontend with JavaScript, TypeScript, React, Next.js, Redux Toolkit and Tailwind. On the backend, I work with Python, Django and Mysql, creating complete, modern and efficient applications.",
    "iam": "I am a fullstack developer focused on",
    "react": "React",
    "and": "and",
    "python": "Python",
    "iCreateWebsites": "I create websites",
    "myResume": "My resume",
    "downloadResume": "Download resume",
    "skills": "Skills",
    "projects": "Projects",
    "website": "Website",
    "repository": "Repository",
    "seeMoreProjects": "See more projects",
    "aboutMe": "About me",
    "myPassion": "My passion for technology motivates me to explore, learn and create solutions that positively impact the world.",
    "communication": "Communication",
    "communicationText": "Ability to convey ideas clearly and effectively, promoting understanding and collaboration on projects.",
    "teamwork": "Teamwork",
    "teamworkText": "Ability to cooperate with different professional profiles, ensuring alignment and success in common goals.",
    "troubleshooting": "Troubleshooting",
    "troubleshootingText": "Ability to identify challenges, propose practical solutions and implement improvements quickly and efficiently.",
    "my": "My",
    "mainSkills": "Main skills",
    "areLinked": "are linked to my ability to collaborate and adapt to different scenarios.",
    "effectiveCommunication": "Effective communication,",
    "arePillars": "are pillars of my work, allowing me to connect with people and face challenges with creativity and efficiency. In addition, I am",
    "dedicated": "Dedicated,",
    "iHaveAn": "I have an",
    "easyTimeLearning": "Easy time learning",
    "newTechnologies": "new technologies and methodologies, and I value",
    "organization": "Organization",
    "proactivity": "Proactivity",
    "toAchieve": "to achieve consistent and quality results.",
    "onThe": "On the",
    "technicalSide": "Technical side",
    "iDevelop": "I develop modern and responsive applications, combining solid experience in ",
    "with": "with",
    "thisCombination": "This combination of technologies allows me to create complete and integrated solutions, always prioritizing efficiency, scalability and the best user experience.",
    "iAmAlways": "I am always looking for new learning and challenges that allow me to grow both professionally and personally. With this combination of technical and behavioral skills, I seek to contribute to innovative projects that generate a positive impact.",
    "more": "More",
    "less":"Less"
  },
  "Navbar": {
    "title": "Thiago Alves",
    "darkMode": "Dark Mode",
    "lightMode": "Light Mode",
    "titleBtnLanguage": "Switch to Portuguese",
    "home": "home",
    "projects": "projects",
    "about": "about",
    "contact": "contact",
    "language": "English"
  },
  "Projects": {
    "title":"My Journey in Lines of Code",
    "text":"Each project is a milestone in this journey, reflecting challenges overcome, lessons learned and innovative solutions. Here are the fruits of my labor: applications that combine functionality, design and technology to solve real problems.",
    "ddmn": "The first paid website I developed. The site has a projects page, an about the company page, and a contact page where users can send emails via a form. It also includes a dynamic map displaying the company address.",
    "best_movies": "A website where you can check the top 20 highest rated movies on the homepage. It also allows you to search for any movie and view the top 20 matching results. When you select a movie, you can access its full details. To make this experience dynamic, the project uses the IMDB API to obtain the information.",
    "bloggers": "A dynamic blog where you can register new posts, authors and categories, allowing for efficient organization of content.",
    "pokenext": "A project that displays a list of Pokémon and their details, providing an interactive experience for fans of the franchise. To develop this site, I used an API, allowing me to obtain dynamic data about each Pokémon. The project was created following a tutorial on YouTube and served as practice for working with API integration.",
    "figbruary": "A website developed from a Figma project, using dynamic routes for navigation between pages. The goal was to transform a design into a functional application, exploring good structuring and styling practices.",
    "my_todo": "A task site that uses localStorage to store data. It allows you to add new tasks, mark them as completed, and delete them. In addition, the system displays the total number of tasks registered and how many have already been completed, providing a clear view of the user's progress.",
    "cpf_generator": "A system that automatically generates valid Brazilian ID. The tool follows Brazilian ID validation rules, ensuring that the numbers generated are formatted correctly and can be used for testing and validation in systems.",
    "password_generator": "A system that generates personalized random passwords. The user can define the length of the password and choose whether to include uppercase letters, lowercase letters, numbers, and symbols. In addition, the system evaluates the strength of the password, classifying it as very weak, weak, medium, or strong. It is also possible to copy the generated password to the clipboard with a simple click.",
    "uniasselvi_average": "A system developed in partnership with a college colleague to calculate the average grade at Uniasselvi. The user can enter the grades of the four assessments and the mock exam to check if he/she passed the subject. If any of the tests were not taken, simply enter the grade zero, and the system will indicate the minimum score required to pass.",
    "countries_of_the_world": "An interactive project that displays detailed information about all countries in the world. It allows searches for specific countries, filtering by region (continent) and has a pagination system to facilitate navigation. In addition, it supports dark mode, providing a personalized experience for users. Data consumption was done from local storage, ensuring speed and efficiency. This project was developed as part of a Frontend Mentor challenge and aims to improve skills in frontend development data organization and user experience.",
    "e-commerce_product_page": "An e-commerce page developed as part of a Frontend Mentor challenge. The project simulates the shopping experience, allowing users to add products to the cart, remove items, and view product images dynamically. The goal of this project is to improve the construction of interactive interfaces and the manipulation of states to provide a fluid and intuitive shopping experience.",
    "product_list_with_cart_main": "A project developed as part of a Frontend Mentor challenge, simulating an e-commerce experience. In it, users can add multiple products to the cart, with the total automatically calculated. In addition, it is possible to remove items individually or empty the cart completely. When completing the purchase, a confirmation popup is displayed, making the interaction more dynamic. The project is also fully responsive, ensuring a fluid experience on different devices."
  },
  "About": {
    "title": "Who Am I Beyond the Code",
    "behindEveryLine":"Behind every line of code, there is a journey of learning, challenges and achievements. I'm passionate about technology and development, always looking to improve my skills and create solutions that make a difference.",
    "experiencesThat":"Experiences that shaped my path.",
    "bornInSaoPaulo":"Born in São Paulo / SP on 11/30/1987, I have lived in Joinville / SC for more than a decade. My professional career has gone through different areas: I was a McDonald's attendant, I worked on the line of production for companies like Tigre and Docol, I was a salesman at Vivo, risk analyst at Opentech and driver. Currently, I work as an application driver, while I prepare to join in the technology area.",
    "selfTaught":"Self-taught and passionate about technology: How I got here.",
    "sinceIWasLittle":"Since I was little, I've always been curious about technology, but it was at the end of 2021 that I decided to turn this passion into a profession. Seeking a career change to provide a better life for my family, I began my studies in programming with Python. Little by little, I also delved deeper into frontend development, learning HTML, CSS and JavaScript.",
    "inJuly2023":"In July 2023, I took an important step by entering the Systems Analysis and Development faculty, where I continue studying to this day. During this journey, I expanded my knowledge to include TypeScript, React, Next.js, Django, MySQL, Git and Redux. I learned most of what I know on my own, through YouTube videos and courses on Udemy. I am self-taught, I find it easy to learn new things and I always try to improve myself.",
    "commitmentTo":"Commitment to Growth and Evolution.",
    "myMainObjective":"My main objective is to gain a position in the development area, where I can combine my passion for technology with the need for a more balanced routine. I want to have a better quality of life and more time to spend with my two children, a 14-year-old girl and a 9-year-old boy. In addition to my experience in programming, over the years I have also taken courses in IT, computer maintenance, basic English and programming logic, which contributed to my technical base and my adaptability.",
    "iAmADedicated":"I am a dedicated, hard-working and communicative person. I like working in a team and I believe that collaboration is essential for professional growth and the success of any project. I am always ready to learn, face challenges and evolve, as I know that technology is a dynamic and constantly changing field. This journey has just begun, and I am determined to build a solid and promising future in the world of development."
  },
  "Footer":{
    "designedAndCodedBy":"Designed and coded by"
  },
  "Contact":{
    "letsBuild":"Let's build something amazing together!",
    "letsTalk":"Let's Talk!",
    "ifYouLikedMyWork":"If you liked my work and want to talk about a project, partnership or any other opportunity, feel free to get in touch!",
    "imAlwaysOpenTo":"I'm always open to new opportunities and collaborations and I'm a developer passionate about creating intuitive interfaces and high-performance web experiences. If you're looking for a professional to strengthen your team or develop a new project, get in touch. I'll respond as soon as possible and I can't wait to work together!",
    "name":"Name",
    "subject":"Subject",
    "message":"Message",
    "tksForYourContact":"Thank you very much for your contact",
    "yourMessageIsAlready":"Your message is already on my priority list! I'll reply to you soon!",
    "back":"Back",
    "sendMessage":"Send message",
    "address":"Address",
    "phoneNumber":"Phone number"
  }
}
