{
  "Home": {
    "title": "Thiago Alves",
    "description": "I develop on the frontend with JavaScript, TypeScript, React, Next.js, Redux Toolkit and Tailwind. On the backend, I work with Python, Django and Mysql, creating complete, modern and efficient applications.",
    "iam": "I am a fullstack developer focused on",
    "react": "React",
    "and": "and",
    "python": "Python",
    "iCreateWebsites": "I create websites",
    "myResume": "My resume",
    "downloadResume": "Download resume",
    "skills": "Skills",
    "projects": "Projects",
    "website": "Website",
    "repository": "Repository",
    "seeMoreProjects": "See more projects",
    "aboutMe": "About me",
    "myPassion": "My passion for technology motivates me to explore, learn and create solutions that positively impact the world.",
    "communication": "Communication",
    "communicationText": "Ability to convey ideas clearly and effectively, promoting understanding and collaboration on projects.",
    "teamwork": "Teamwork",
    "teamworkText": "Ability to cooperate with different professional profiles, ensuring alignment and success in common goals.",
    "troubleshooting": "Troubleshooting",
    "troubleshootingText": "Ability to identify challenges, propose practical solutions and implement improvements quickly and efficiently.",
    "my": "My",
    "mainSkills": "Main skills",
    "areLinked": "are linked to my ability to collaborate and adapt to different scenarios.",
    "effectiveCommunication": "Effective communication,",
    "arePillars": "are pillars of my work, allowing me to connect with people and face challenges with creativity and efficiency. In addition, I am",
    "dedicated": "Dedicated,",
    "iHaveAn": "I have an",
    "easyTimeLearning": "Easy time learning",
    "newTechnologies": "new technologies and methodologies, and I value",
    "organization": "Organization",
    "proactivity": "Proactivity",
    "toAchieve": "to achieve consistent and quality results.",
    "onThe": "On the",
    "technicalSide": "Technical side",
    "iDevelop": "I develop modern and responsive applications, combining solid experience in ",
    "with": "with",
    "thisCombination": "This combination of technologies allows me to create complete and integrated solutions, always prioritizing efficiency, scalability and the best user experience.",
    "iAmAlways": "I am always looking for new learning and challenges that allow me to grow both professionally and personally. With this combination of technical and behavioral skills, I seek to contribute to innovative projects that generate a positive impact.",
    "more": "More"
  },
  "Navbar": {
    "title": "Thiago Alves",
    "darkMode": "Dark Mode",
    "lightMode": "Light Mode",
    "titleBtnLanguage": "Switch to Portuguese",
    "home": "home",
    "projects": "projects",
    "about": "about",
    "contact": "contact",
    "language": "English"
  },
  "Projects": {
    "ddmn": "My first paid website created for a construction company in Joinville",
    "best_movies": "A website where you can see the top 20 rated movies on the homepage and in addition, you can search for any movie and see the top 20 results.",
    "bloggers": "A complete blog, where new posts, authors and categories can be registered.",
    "pokenext": "A website that shows some Pokémon and their details.",
    "figbruary": "A website created through a figma project using dynamic routes.",
    "my_todo": "A task site using localStorage.",
    "gerador_de_cpf": "A system that generates valid CPFs.",
    "gerador_de_senha": "A system that generates random passwords, being able to choose between upper or lower case letters, numbers and symbols, in addition to defining the length of the password.",
    "média_uniasselvi": "A system I created in partnership with a college friend to calculate the average Uniasselvi grades.",
    "countries_of_the_world": "I'm still going to write an elaborate description",
    "e-commerce_product_page": "I'm still going to write an elaborate description",
    "product_list_with_cart_main": "I'm still going to write an elaborate description"
  }
}
