{
  "Home": {
    "title": "Thiago Alves",
    "description": "Desenvolvo no frontend com JavaScript, TypeScript, React, Next.js, Redux Toolkit e Tailwind. No backend, trabalho com Python Django e Mysql, criando aplicações completas, modernas e eficientes.",
    "iam": "Eu sou desenvolvedor fullstack focado em",
    "react": "React",
    "and": "e",
    "python": "Python",
    "iCreateWebsites": "Eu crio Websites",
    "myResume": "Meu currículo",
    "downloadResume": "Baixar currículo",
    "skills": "Habilidades",
    "projects": "Projetos",
    "website": "Site",
    "repository": "Repositório",
    "seeMoreProjects": "Veja mais projetos",
    "aboutMe": "Sobre mim",
    "myPassion": "Minha paixão por tecnologia me motiva a explorar, aprender e criar soluções que impactem positivamente o mundo.",
    "communication": "Comunicação",
    "communicationText": "Habilidade de transmitir ideias de forma clara e eficaz, promovendo entendimento e colaboração em projetos.",
    "teamwork": "Trabalho em equipe",
    "teamworkText": "Capacidade de cooperar com diferentes perfis profissionais, garantindo alinhamento e sucesso nos objetivos comuns.",
    "troubleshooting": "Resolução de problemas",
    "troubleshootingText": "Aptidão para identificar desafios, propor soluções práticas e implementar melhorias rapidamente e com eficiência.",
    "my": "Minhas",
    "mainSkills": "Principais habilidades",
    "areLinked": "estão ligadas à minha capacidade de colaborar e me adaptar a diferentes cenários.",
    "effectiveCommunication": " Comunicação eficaz,",
    "arePillars": "são pilares da minha atuação, permitindo que eu me conecte com as pessoas e enfrente desafios com criatividade e eficiência. Além disso, sou",
    "dedicated": "Dedicado,",
    "iHaveAn": "tenho",
    "easyTimeLearning": "Facilidade em aprender",
    "newTechnologies": "novas tecnologias e metodologias, e valorizo a",
    "organization": "Organização ",
    "proactivity": "Proatividade ",
    "toAchieve": "para alcançar resultados consistentes e de qualidade.",
    "onThe": "No",
    "technicalSide": "Aspecto técnico",
    "iDevelop": "desenvolvo aplicações modernas e responsivas, combinando uma experiência sólida em ",
    "with": "com",
    "thisCombination": "Essa combinação de tecnologias me permite criar soluções completas e integradas, sempre priorizando eficiência, escalabilidade e a melhor experiência para os usuários.",
    "iAmAlways": "Estou sempre em busca de novos aprendizados e desafios que me permitam crescer tanto no âmbito profissional quanto no pessoal. Com essa união de habilidades técnicas e comportamentais, busco contribuir para projetos inovadores e que gerem impacto positivo.",
    "more": "Mais",
    "less":"Menos"
  },
  "Navbar": {
    "title": "Thiago Alves",
    "darkMode": "Modo Escuro",
    "lightMode": "Modo Claro",
    "titleBtnLanguage": "Trocar para inglês",
    "home": "Início",
    "projects": "projetos",
    "about": "sobre",
    "contact": "contato",
    "language": "Português"
  },
  "Projects": {
    "title":"Minha Jornada em Linhas de Código",
    "text":"Cada projeto é um marco dessa trajetória, refletindo desafios superados, aprendizados conquistados e soluções inovadoras. Aqui estão os frutos do meu trabalho: aplicações que aliam funcionalidade, design e tecnologia para resolver problemas reais.",
    "ddmn": "Meu primeiro site remunerado criado para uma construtora de Joinville",
    "best_movies": "Um site onde você pode ver os 20 filmes mais bem avaliados na página inicial e além disso, você pode pesquisar qualquer filme e ver os 20 melhores resultados.",
    "bloggers": "Um blog completo, onde pode ser cadastrados novos posts, autores e categorias.",
    "pokenext": "Um projeto que exibe uma lista de Pokémons e seus detalhes, proporcionando uma experiência interativa para os fãs da franquia. Para desenvolver esse site, utilizei o consumo de uma API, permitindo a obtenção de dados dinâmicos sobre cada Pokémon. O projeto foi criado seguindo um tutorial no YouTube e serviu como prática para trabalhar com integração de APIs.",
    "figbruary": "Um site desenvolvido a partir de um projeto no Figma, utilizando rotas dinâmicas para navegação entre as páginas. O objetivo foi transformar um design em uma aplicação funcional, explorando boas práticas de estruturação e estilização.",
    "my_todo": "Um site de tarefas que utiliza localStorage para armazenar os dados. Nele, é possível adicionar novas tarefas, marcar como concluídas e excluí-las. Além disso, o sistema exibe o total de tarefas cadastradas e quantas já foram concluídas, proporcionando uma visão clara do progresso do usuário.",
    "cpf_generator": "Um sistema que gera CPFs válidos.",
    "password_generator": "A system that generates random passwords, being able to choose between upper or lower case letters, numbers and symbols, in addition to defining the length of the password.",
    "uniasselvi_average": "Um sistema que criei em parceria com um colega de faculdade para calcular a média das notas da Uniasselvi.",
    "countries_of_the_world": "Um projeto interativo que exibe informações detalhadas sobre todos os países do mundo. Ele permite buscas por países específicos, filtragem por região (continente) e conta com um sistema de paginação para facilitar a navegação. Além disso, oferece suporte a dark mode, proporcionando uma experiência personalizada para os usuários. O consumo de dados foi feito a partir de um armazenamento local, garantindo rapidez e eficiência. Este projeto foi desenvolvido como parte de um desafio do Frontend Mentor e tem como objetivo aprimorar habilidades em desenvolvimento frontend, organização de dados e experiência do usuário.",
    "e-commerce_product_page": "Uma página de e-commerce desenvolvida como parte de um desafio do Frontend Mentor. O projeto simula a experiência de compra, permitindo que os usuários adicionem produtos ao carrinho, removam itens e visualizem as imagens do produto de forma dinâmica. O objetivo deste projeto é aprimorar a construção de interfaces interativas e a manipulação de estados para proporcionar uma experiência de compra fluida e intuitiva.",
    "product_list_with_cart_main": "Um projeto desenvolvido como parte de um desafio do Frontend Mentor, simulando uma experiência de e-commerce. Nele, os usuários podem adicionar diversos produtos ao carrinho, com cálculo automático do total. Além disso, é possível remover itens individualmente ou esvaziar o carrinho por completo.Ao finalizar a compra, uma popup de confirmação é exibida, tornando a interação mais dinâmica. O projeto também é totalmente responsivo, garantindo uma experiência fluida em diferentes dispositivos."
  },
  "About": {
    "title": "Quem Sou Eu Além do Código",
    "behindEveryLine":"Por trás de cada linha de código, existe uma jornada de aprendizado, desafios e conquistas. Sou apaixonado por tecnologia e desenvolvimento, sempre em busca de aprimorar minhas habilidades e criar soluções que fazem a diferença.",
    "experiencesThat":"Experiências que moldaram meu caminho.",
    "bornInSaoPaulo":"Nascido em São Paulo / SP em 30/11/1987, moro em Joinville / SC há mais de uma década. Minha trajetória profissional passou por diversas áreas: já fui atendente do McDonald´s, trabalhei na linha de produção de empresas como Tigre e Docol, fui vendedor da Vivo, analista de risco na Opentech e motorista. Atualmente, trabalho como motorista de aplicativo, enquanto me preparo para ingressar na área de tecnologia.",
    "selfTaught":"Autodidata e apaixonado por tecnologia: Como cheguei até aqui.",
    "sinceIWasLittle":"Desde pequeno, sempre tive curiosidade sobre tecnologia, mas foi no final de 2021 que decidi transformar essa paixão em profissão. Buscando uma mudança de carreira para proporcionar uma vida melhor para minha família, iniciei meus estudos em programação com Python. Aos poucos, me aprofundei também no desenvolvimento frontend, aprendendo HTML, CSS e JavaScript.",
    "inJuly2023":"Em julho de 2023, dei um passo importante ao ingressar na faculdade de Análise e Desenvolvimento de Sistemas, onde sigo estudando até hoje. Durante essa trajetória, ampliei meus conhecimentos para incluir TypeScript, React, Next.js, Django, MySQL, Git e Redux. A maior parte do que sei aprendi por conta própria, por meio de vídeos no YouTube e cursos na Udemy. Sou autodidata, tenho facilidade em aprender coisas novas e sempre busco me aprimorar.",
    "commitmentTo":"Compromisso com o Crescimento e a Evolução.",
    "myMainObjective":"Meu principal objetivo é conquistar uma posição na área de desenvolvimento, onde poderei unir minha paixão por tecnologia à necessidade de uma rotina mais equilibrada. Quero ter mais qualidade de vida e mais tempo para estar com meus dois filhos, uma menina de 14 anos e um menino de 9 anos. Além da experiência em programação, ao longo dos anos também fiz cursos de informática, manutenção de computadores, inglês básico e lógica de programação, o que contribuiu para minha base técnica e minha adaptabilidade.",
    "iAmADedicated":"Sou uma pessoa dedicada, esforçada e comunicativa. Gosto de trabalhar em equipe e acredito que a colaboração é essencial para o crescimento profissional e para o sucesso de qualquer projeto. Estou sempre pronto para aprender, enfrentar desafios e evoluir, pois sei que a tecnologia é um campo dinâmico e em constante transformação. Essa jornada está apenas começando, e estou determinado a construir um futuro sólido e promissor no mundo do desenvolvimento."
  },
  "Footer":{
    "designedAndCodedBy":"Projetado e codificado por"
  }
}
