{
  "Home": {
    "title": "Thiago Alves",
    "description": "Desenvolvo no frontend com JavaScript, TypeScript, React, Next.js, Redux Toolkit e Tailwind. No backend, trabalho com Python Django e Mysql, criando aplicações completas, modernas e eficientes.",
    "iam": "Eu sou desenvolvedor fullstack focado em",
    "react": "React",
    "and": "e",
    "python": "Python",
    "iCreateWebsites": "Eu crio Websites",
    "myResume": "Meu currículo",
    "downloadResume": "Baixar currículo",
    "skills": "Habilidades",
    "projects": "Projetos",
    "website": "Site",
    "repository": "Repositório",
    "seeMoreProjects": "Veja mais projetos",
    "aboutMe": "Sobre mim",
    "myPassion": "Minha paixão por tecnologia me motiva a explorar, aprender e criar soluções que impactem positivamente o mundo.",
    "communication": "Comunicação",
    "communicationText": "Habilidade de transmitir ideias de forma clara e eficaz, promovendo entendimento e colaboração em projetos.",
    "teamwork": "Trabalho em equipe",
    "teamworkText": "Capacidade de cooperar com diferentes perfis profissionais, garantindo alinhamento e sucesso nos objetivos comuns.",
    "troubleshooting": "Resolução de problemas",
    "troubleshootingText": "Aptidão para identificar desafios, propor soluções práticas e implementar melhorias rapidamente e com eficiência.",
    "my": "Minhas",
    "mainSkills": "Principais habilidades",
    "areLinked": "estão ligadas à minha capacidade de colaborar e me adaptar a diferentes cenários.",
    "effectiveCommunication": " Comunicação eficaz,",
    "arePillars": "são pilares da minha atuação, permitindo que eu me conecte com as pessoas e enfrente desafios com criatividade e eficiência. Além disso, sou",
    "dedicated": "Dedicado,",
    "iHaveAn": "tenho",
    "easyTimeLearning": "Facilidade em aprender",
    "newTechnologies": "novas tecnologias e metodologias, e valorizo a",
    "organization": "Organização ",
    "proactivity": "Proatividade ",
    "toAchieve": "para alcançar resultados consistentes e de qualidade.",
    "onThe": "No",
    "technicalSide": "Aspecto técnico",
    "iDevelop": "desenvolvo aplicações modernas e responsivas, combinando uma experiência sólida em ",
    "with": "com",
    "thisCombination": "Essa combinação de tecnologias me permite criar soluções completas e integradas, sempre priorizando eficiência, escalabilidade e a melhor experiência para os usuários.",
    "iAmAlways": "Estou sempre em busca de novos aprendizados e desafios que me permitam crescer tanto no âmbito profissional quanto no pessoal. Com essa união de habilidades técnicas e comportamentais, busco contribuir para projetos inovadores e que gerem impacto positivo.",
    "more": "Mais"
  },
  "Navbar": {
    "title": "Thiago Alves",
    "darkMode": "Modo Escuro",
    "lightMode": "Modo Claro",
    "titleBtnLanguage": "Trocar para inglês",
    "home": "Início",
    "projects": "projetos",
    "about": "sobre",
    "contact": "contato",
    "language": "Português"
  },
  "Projects": {
    "ddmn": "Meu primeiro site remunerado criado para uma construtora de Joinville",
    "best_movies": "Um site onde você pode ver os 20 filmes mais bem avaliados na página inicial e além disso, você pode pesquisar qualquer filme e ver os 20 melhores resultados.",
    "bloggers": "Um blog completo, onde pode ser cadastrados novos posts, autores e categorias.",
    "pokenext": "Um site que mostra alguns pokémons e seus detalhes.",
    "figbruary": "Um site criado através de um projeto figma utilizando dynamic rotes.",
    "my_todo": "Um site de tarefas utilizando localStorage.",
    "cpf_generator": "Um sistema que gera CPFs válidos.",
    "password_generator": "A system that generates random passwords, being able to choose between upper or lower case letters, numbers and symbols, in addition to defining the length of the password.",
    "uniasselvi_average": "Um sistema que criei em parceria com um colega de faculdade para calcular a média das notas da Uniasselvi.",
    "countries_of_the_world": "Ainda vou fazer uma descrição elaborada",
    "e-commerce_product_page": "I'm still going to write an elaborate description",
    "product_list_with_cart_main": "I'm still going to write an elaborate description"
  }
}
